Using TensorFlow backend.
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to
====================================================================================================
input_1 (InputLayer)             (None, 120, 160, 3)   0
____________________________________________________________________________________________________
block1_conv1 (Convolution2D)     (None, 120, 160, 64)  1792        input_1[0][0]
____________________________________________________________________________________________________
block1_conv2 (Convolution2D)     (None, 120, 160, 64)  36928       block1_conv1[0][0]
____________________________________________________________________________________________________
block1_pool (MaxPooling2D)       (None, 60, 80, 64)    0           block1_conv2[0][0]
____________________________________________________________________________________________________
block2_conv1 (Convolution2D)     (None, 60, 80, 128)   73856       block1_pool[0][0]
____________________________________________________________________________________________________
block2_conv2 (Convolution2D)     (None, 60, 80, 128)   147584      block2_conv1[0][0]
____________________________________________________________________________________________________
block2_pool (MaxPooling2D)       (None, 30, 40, 128)   0           block2_conv2[0][0]
____________________________________________________________________________________________________
block3_conv1 (Convolution2D)     (None, 30, 40, 256)   295168      block2_pool[0][0]
____________________________________________________________________________________________________
block3_conv2 (Convolution2D)     (None, 30, 40, 256)   590080      block3_conv1[0][0]
____________________________________________________________________________________________________
block3_conv3 (Convolution2D)     (None, 30, 40, 256)   590080      block3_conv2[0][0]
____________________________________________________________________________________________________
block3_pool (MaxPooling2D)       (None, 15, 20, 256)   0           block3_conv3[0][0]
____________________________________________________________________________________________________
block4_conv1 (Convolution2D)     (None, 15, 20, 512)   1180160     block3_pool[0][0]
____________________________________________________________________________________________________
block4_conv2 (Convolution2D)     (None, 15, 20, 512)   2359808     block4_conv1[0][0]
____________________________________________________________________________________________________
block4_conv3 (Convolution2D)     (None, 15, 20, 512)   2359808     block4_conv2[0][0]
____________________________________________________________________________________________________
block4_pool (MaxPooling2D)       (None, 7, 10, 512)    0           block4_conv3[0][0]
____________________________________________________________________________________________________
block5_conv1 (Convolution2D)     (None, 7, 10, 512)    2359808     block4_pool[0][0]
____________________________________________________________________________________________________
block5_conv2 (Convolution2D)     (None, 7, 10, 512)    2359808     block5_conv1[0][0]
____________________________________________________________________________________________________
block5_conv3 (Convolution2D)     (None, 7, 10, 512)    2359808     block5_conv2[0][0]
____________________________________________________________________________________________________
block5_pool (MaxPooling2D)       (None, 3, 5, 512)     0           block5_conv3[0][0]
____________________________________________________________________________________________________
flatten (Flatten)                (None, 7680)          0           block5_pool[0][0]
____________________________________________________________________________________________________
fc1 (Dense)                      (None, 2048)          15730688    flatten[0][0]
____________________________________________________________________________________________________
fc2 (Dense)                      (None, 256)           524544      fc1[0][0]
____________________________________________________________________________________________________
predictions (Dense)              (None, 6)             1542        fc2[0][0]
====================================================================================================
Total params: 30,971,462
Trainable params: 16,256,774
Non-trainable params: 14,714,688
____________________________________________________________________________________________________
None
[mpeg4 @ 000000e5050b1200] ac-tex damaged at 8 6
[mpeg4 @ 000000e5050b1200] Error at MB: 74
Train on 6479 samples, validate on 1620 samples
Epoch 1/1
6464/6479 [============================>.] - ETA: 7s - loss: 0.5062 - acc: 0.8880 Epoch 00000: saving model to /tmp/weights.hdf5
6479/6479 [==============================] - 4026s - loss: 0.5051 - acc: 0.8883 - val_loss: 12.7751 - val_acc: 0.0210
Train on 7264 samples, validate on 1816 samples
Epoch 1/1
7232/7264 [============================>.] - ETA: 15s - loss: 0.3985 - acc: 0.8704Epoch 00000: saving model to /tmp/weights.hdf5
7264/7264 [==============================] - 4303s - loss: 0.3974 - acc: 0.8707 - val_loss: 11.7024 - val_acc: 0.0000e+00
Train on 7657 samples, validate on 1915 samples
Epoch 1/1
7648/7657 [============================>.] - ETA: 4s - loss: 0.2920 - acc: 0.8915 Epoch 00000: saving model to /tmp/weights.hdf5
7657/7657 [==============================] - 4582s - loss: 0.2916 - acc: 0.8916 - val_loss: 5.5331 - val_acc: 0.1164
Train on 7085 samples, validate on 1772 samples
Epoch 1/1
7072/7085 [============================>.] - ETA: 6s - loss: 0.1890 - acc: 0.9283 Epoch 00000: saving model to /tmp/weights.hdf5
7085/7085 [==============================] - 4201s - loss: 0.1887 - acc: 0.9284 - val_loss: 11.9955 - val_acc: 0.0220
Train on 6634 samples, validate on 1659 samples
Epoch 1/1
6624/6634 [============================>.] - ETA: 4s - loss: 0.1778 - acc: 0.9321 Epoch 00000: saving model to /tmp/weights.hdf5
6634/6634 [==============================] - 3927s - loss: 0.1780 - acc: 0.9320 - val_loss: 11.6630 - val_acc: 0.0030
Train on 6573 samples, validate on 1644 samples
Epoch 1/1
6560/6573 [============================>.] - ETA: 6s - loss: 0.2567 - acc: 0.8997 Epoch 00000: saving model to /tmp/weights.hdf5
6573/6573 [==============================] - 4046s - loss: 0.2562 - acc: 0.8999 - val_loss: 11.8554 - val_acc: 0.0109
Train on 7478 samples, validate on 1870 samples
Epoch 1/1
7456/7478 [============================>.] - ETA: 33s - loss: 0.1087 - acc: 0.9628Epoch 00000: saving model to /tmp/weights.hdf5
7478/7478 [==============================] - 12256s - loss: 0.1087 - acc: 0.9628 - val_loss: 10.3505 - val_acc: 0.0316
Train on 6941 samples, validate on 1736 samples